[
  {
    "Table name": "Electric Vehicle Population Data",
    "Table schema": "Based on the given dataset 'Electric Vehicle Population Data' with the example records provided, a likely table schema for storing this data in a relational database could look like the following:\n\nTable Name: Electric_Vehicles\n\nColumns:\n- VIN (1-10) (Primary Key, 10 characters)\n- County (String)\n- City (String)\n- State (String)\n- Postal Code (String)\n- Model Year (Integer)\n- Make (String)\n- Model (String)\n- Electric Vehicle Type (String)\n- Clean Alternative Fuel Vehicle (CAFV) Eligibility (String)\n- Electric Range (Integer)\n- Base MSRP (Decimal)\n- Legislative District (Integer)\n- DOL Vehicle ID (String)\n- Vehicle Location (Geospatial Point datatype)\n- Electric Utility (String)\n- 2020 Census Tract (String)\n\nWith this schema, you can create a table to store Electric Vehicle data with columns to represent different attributes of each vehicle. The VIN (1-10) column is set as the primary key assuming it uniquely identifies each vehicle. The Vehicle Location column can be stored using a geospatial datatype, depending on the database system being used.\n\nYou can expand or modify this schema based on additional data attributes or specific requirements for querying and analysis.",
    "Table description": "This dataset shows the Battery Electric Vehicles (BEVs) and Plug-in Hybrid Electric Vehicles (PHEVs) that are currently registered through Washington State Department of Licensing (DOL).",
    "Table tags": [
      "bev",
      "bevs",
      "bolt",
      "car",
      "cars",
      "chevrolet",
      "chevy",
      "clean-energy",
      "department-of-licensing",
      "dol",
      "dol_open_data",
      "electric",
      "energy",
      "environment",
      "ev",
      "evs",
      "green-report",
      "hybrid",
      "hybrids",
      "leaf",
      "model-3",
      "nhtsa",
      "nissan",
      "phev",
      "phevs",
      "plug-in",
      "plug-ins",
      "population",
      "rao_ev",
      "rao_open_data",
      "rao_veh",
      "tesla",
      "vehicle",
      "vehicles",
      "volt"
    ],
    "Popularity": 9872,
    "Previous queries": "1. Show me a list of Battery Electric Vehicles (BEVs) in Washington State.\n2. Find all Plug-in Hybrid Electric Vehicles (PHEVs) registered in Seattle.\n3. Give me details of TESLA vehicles in King County.\n4. Show electric vehicles eligible for Clean Alternative Fuel Vehicle (CAFV) in Snohomish.\n5. Filter electric vehicles by model year in 2023.\n6. Display electric vehicles with an unknown battery range.\n7. Find vehicles with a Legislative District of '1'.\n8. Show all electric vehicles with a 0 base MSRP.\n9. List electric vehicles registered in Bothell.\n10. Identify Electric Utility providers for TESLA vehicles in Washington.",
    "Granularity": "Based on the dataset provided, the level of data granularity appears to be relatively high. Each entry in the dataset contains detailed information about individual electric vehicles, including VIN, county, city, state, postal code, model year, make, model, electric vehicle type, electric range, base MSRP, legislative district, DOL vehicle ID, vehicle location, electric utility, and census tract.\n\nThis level of granularity allows for detailed analysis and tracking of each electric vehicle registered through the Washington State Department of Licensing. Each data point provides specific attributes about a particular vehicle, enabling comprehensive insights into the electric vehicle population in the region.",
    "Example records": [
      {
        "VIN (1-10)": "5YJYGDEE1L",
        "County": "King",
        "City": "Seattle",
        "State": "WA",
        "Postal Code": "98122",
        "Model Year": "2020",
        "Make": "TESLA",
        "Model": "MODEL Y",
        "Electric Vehicle Type": "Battery Electric Vehicle (BEV)",
        "Clean Alternative Fuel Vehicle (CAFV) Eligibility": "Clean Alternative Fuel Vehicle Eligible",
        "Electric Range": "291",
        "Base MSRP": "0",
        "Legislative District": "37",
        "DOL Vehicle ID": "125701579",
        "Vehicle Location": "POINT (-122.30839 47.610365)",
        "Electric Utility": "CITY OF SEATTLE - (WA)|CITY OF TACOMA - (WA)",
        "2020 Census Tract": "53033007800"
      },
      {
        "VIN (1-10)": "7SAYGDEE9P",
        "County": "Snohomish",
        "City": "Bothell",
        "State": "WA",
        "Postal Code": "98021",
        "Model Year": "2023",
        "Make": "TESLA",
        "Model": "MODEL Y",
        "Electric Vehicle Type": "Battery Electric Vehicle (BEV)",
        "Clean Alternative Fuel Vehicle (CAFV) Eligibility": "Eligibility unknown as battery range has not been researched",
        "Electric Range": "0",
        "Base MSRP": "0",
        "Legislative District": "1",
        "DOL Vehicle ID": "244285107",
        "Vehicle Location": "POINT (-122.179458 47.802589)",
        "Electric Utility": "PUGET SOUND ENERGY INC",
        "2020 Census Tract": "53061051938"
      }
    ]
  },
  {
    "Table name": "Crime Data from 2020 to Present",
    "Table schema": "Based on the example records provided, a likely table schema for the 'Crime Data from 2020 to Present' dataset could include the following fields:\n\n1. DR_NO (Data Report Number) - Unique identifier for each crime report\n2. Date Rptd (Date Reported) - Date when the crime was reported\n3. DATE OCC (Date Occurred) - Date when the crime occurred\n4. TIME OCC (Time Occurred) - Time when the crime occurred\n5. AREA - Code for the geographical area where the crime occurred\n6. AREA NAME - Name of the geographical area where the crime occurred\n7. Rpt Dist No (Reporting District Number) - Reporting district number for the crime\n8. Part 1-2 - Type of crime\n9. Crm Cd (Crime Code) - Code for the type of crime\n10. Crm Cd Desc (Crime Code Description) - Description of the type of crime\n11. Mocodes (Modus Operandi codes) - Codes describing the method of operation used in the crime\n12. Vict Age (Victim Age) - Age of the victim\n13. Vict Sex (Victim Sex) - Gender of the victim\n14. Vict Descent (Victim Descent) - Descent of the victim\n15. Premis Cd (Premise Code) - Code for the type of location where the crime occurred\n16. Premis Desc (Premise Description) - Description of the location where the crime occurred\n17. Weapon Used Cd (Weapon Used Code) - Code for any weapon used in the crime\n18. Weapon Desc (Weapon Description) - Description of the weapon used in the crime\n19. Status - Code indicating the status of the crime report\n20. Status Desc (Status Description) - Description of the status of the crime report\n21. Crm Cd 1, Crm Cd 2, Crm Cd 3, Crm Cd 4 - Additional crime codes associated with the incident\n22. LOCATION - General location of the crime\n23. Cross Street - Cross street related to the crime location\n24. LAT (Latitude) - Latitude coordinates of the crime location\n25. LON (Longitude) - Longitude coordinates of the crime location\n\nThis schema captures essential details about each crime incident reported in the dataset, including information about the crime itself, the victim, the location, and any associated codes or statuses.",
    "Table description": "***Starting on March 7th, 2024, the Los Angeles Police Department (LAPD) will adopt a new Records Management System for reporting crimes and arrests. This new system is being implemented to comply with the FBI's mandate to collect NIBRS-only data (NIBRS — FBI).\nDuring this transition, users will temporarily see only incidents reported in the retiring system. However, the LAPD is actively working on generating new NIBRS datasets to ensure a smoother and more efficient reporting system. ***\n\n******Update 1/18/2024 - LAPD is facing issues with posting the Crime data, but we are taking immediate action to resolve the problem. We understand the importance of providing reliable and up-to-date information and are committed to delivering it.\n\nAs we work through the issues, we have temporarily reduced our updates from weekly to bi-weekly to ensure that we provide accurate information. Our team is actively working to identify and resolve these issues promptly.\n\nWe apologize for any inconvenience this may cause and appreciate your understanding. Rest assured, we are doing everything we can to fix the problem and get back to providing weekly updates as soon as possible. ****** \n\n\nThis dataset reflects incidents of crime in the City of Los Angeles dating back to 2020. This data is transcribed from original crime reports that are typed on paper and therefore there may be some inaccuracies within the data. Some location fields with missing data are noted as (0°, 0°). Address fields are only provided to the nearest hundred block in order to maintain privacy. This data is as accurate as the data in the database. Please note questions or concerns in the comments.",
    "Table tags": [
      "crime",
      "crime-data",
      "crimes",
      "lapd",
      "police",
      "safe-city"
    ],
    "Popularity": 6323,
    "Previous queries": "1. Show me all incidents of vehicle theft reported in Wilshire in 2020.\n2. How many burglaries from vehicles were reported in Central in February 2020?\n3. Provide a breakdown of crimes reported in the vicinity of 1000 S FLOWER ST.\n4. List all arrests made in relation to stolen vehicles in Wilshire in 2020.\n5. Show me the trend of crimes reported on streets in Los Angeles in 2020.\n6. How many incidents at bus stops were reported in Central district in 2020?\n7. Provide details of unsolved burglaries from vehicles in Los Angeles in 2020.",
    "Granularity": "Based on the provided dataset entries, the level of data granularity is at the individual crime incident level. Each entry represents a specific incident of crime in the City of Los Angeles and includes details such as the report number, dates, times, crime categories, locations (with approximate address details for privacy), involved individuals' demographic information, status of the case, and more. The dataset captures detailed information for each reported crime incident, providing a comprehensive view of criminal activities in the city.",
    "Example records": [
      {
        "DR_NO": "190326475",
        "Date Rptd": "03/01/2020 12:00:00 AM",
        "DATE OCC": "03/01/2020 12:00:00 AM",
        "TIME OCC": "2130",
        "AREA": "07",
        "AREA NAME": "Wilshire",
        "Rpt Dist No": "0784",
        "Part 1-2": "1",
        "Crm Cd": "510",
        "Crm Cd Desc": "VEHICLE - STOLEN",
        "Mocodes": "",
        "Vict Age": "0",
        "Vict Sex": "M",
        "Vict Descent": "O",
        "Premis Cd": "101",
        "Premis Desc": "STREET",
        "Weapon Used Cd": "",
        "Weapon Desc": "",
        "Status": "AA",
        "Status Desc": "Adult Arrest",
        "Crm Cd 1": "510",
        "Crm Cd 2": "998",
        "Crm Cd 3": "",
        "Crm Cd 4": "",
        "LOCATION": "1900 S  LONGWOOD                     AV",
        "Cross Street": "",
        "LAT": "34.0375",
        "LON": "-118.3506"
      },
      {
        "DR_NO": "200106753",
        "Date Rptd": "02/09/2020 12:00:00 AM",
        "DATE OCC": "02/08/2020 12:00:00 AM",
        "TIME OCC": "1800",
        "AREA": "01",
        "AREA NAME": "Central",
        "Rpt Dist No": "0182",
        "Part 1-2": "1",
        "Crm Cd": "330",
        "Crm Cd Desc": "BURGLARY FROM VEHICLE",
        "Mocodes": "1822 1402 0344",
        "Vict Age": "47",
        "Vict Sex": "M",
        "Vict Descent": "O",
        "Premis Cd": "128",
        "Premis Desc": "BUS STOP/LAYOVER (ALSO QUERY 124)",
        "Weapon Used Cd": "",
        "Weapon Desc": "",
        "Status": "IC",
        "Status Desc": "Invest Cont",
        "Crm Cd 1": "330",
        "Crm Cd 2": "998",
        "Crm Cd 3": "",
        "Crm Cd 4": "",
        "LOCATION": "1000 S  FLOWER                       ST",
        "Cross Street": "",
        "LAT": "34.0444",
        "LON": "-118.2628"
      }
    ]
  }
]